Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombinedDimensionAttributes
The CombinedDimensionAttributes class handles attributes related to
the combination of identical parts of dimensions.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombinedDimensionAttributes.MinimumNumberToCombine
The minimum number of dimensions to be combined.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombinedDimensionAttributes.Format
The combined dimension format.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombinedDimensionAttributes.#ctor
Creates a new combined dimension attributes instance.
The defaults combine a minimum of three identical dimensions to be
shown as the number of items times the length of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombinedDimensionAttributes.#ctor(System.Int32,Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombineFormats)
Creates a new combined dimension attributes instance with the given parameters.
minimumNumberToCombine: The minimum number of dimensions to be combined.
format: The format of the combined dimensions.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombinedDimensionAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.